{"365":49,"<PAD>":0,"<OOV>":1,"in":2,"of":3,"completion":4,"certification":5,"successful":6,"bootcamp":7,"certificate":8,"professional":9,"engineer":10,"this":11,"certifies":12,"that":13,"student":14,"has":15,"completed":16,"training":17,"expertise":18,"and":19,"related":20,"technologies":21,"awarded":22,"for":23,"excellence":24,"development":25,"verified":26,"developer":27,"ui":28,"azure":29,"data":30,"ci":31,"testing":32,"swift":33,"ruby":34,"bash":35,"react":36,"redis":37,"kafka":38,"github":39,"cd":40,"gitlab":41,"app":42,"cloud":43,"learning":44,"ai":45,"engineering":46,"android":47,"studio":48,"python":50,"java":51,"javascript":52,"typescript":53,"go":54,"rust":55,"kotlin":56,"php":57,"scala":58,"matlab":59,"dart":60,"powershell":61,"perl":62,"haskell":63,"clojure":64,"elixir":65,"erlang":66,"lua":67,"julia":68,"objectivec":69,"fortran":70,"assembly":71,"solidity":72,"html":73,"css":74,"sass":75,"tailwind":76,"bootstrap":77,"angular":78,"vue":79,"nextjs":80,"nuxtjs":81,"redux":82,"webpack":83,"vite":84,"threejs":85,"d3js":86,"ux":87,"figma":88,"adobe":89,"xd":90,"svelte":91,"emberjs":92,"backbonejs":93,"material":94,"ant":95,"design":96,"chakra":97,"styled":98,"components":99,"framer":100,"motion":101,"gsap":102,"sketch":103,"invision":104,"zeplin":105,"node":106,"express":107,"django":108,"flask":109,"spring":110,"boot":111,"laravel":112,"aspnet":113,"fastapi":114,"graphql":115,"rest":116,"api":117,"microservices":118,"authentication":119,"jwt":120,"nest":121,"js":122,"koa":123,"meteor":124,"on":125,"rails":126,"phoenix":127,"grpc":128,"soap":129,"websocket":130,"webrtc":131,"websockets":132,"oauth":133,"saml":134,"sso":135,"memcached":136,"rabbitmq":137,"celery":138,"mongodb":139,"mysql":140,"postgresql":141,"sqlite":142,"cassandra":143,"firebase":144,"dynamodb":145,"neo4j":146,"elasticsearch":147,"mariadb":148,"oracle":149,"sql":150,"server":151,"db2":152,"couchbase":153,"couchdb":154,"influxdb":155,"timescaledb":156,"hadoop":157,"spark":158,"hive":159,"presto":160,"snowflake":161,"bigquery":162,"redshift":163,"supabase":164,"prisma":165,"typeorm":166,"mongoose":167,"sequelize":168,"hibernate":169,"aws":170,"gcp":171,"docker":172,"kubernetes":173,"terraform":174,"ansible":175,"jenkins":176,"actions":177,"nginx":178,"linux":179,"scripting":180,"circleci":181,"travis":182,"argo":183,"pulumi":184,"chef":185,"puppet":186,"vagrant":187,"packer":188,"promotheus":189,"grafana":190,"datadog":191,"new":192,"relic":193,"splunk":194,"elk":195,"stack":196,"logstash":197,"kibana":198,"fluentd":199,"istio":200,"envoy":201,"helm":202,"serverless":203,"lambda":204,"cloudfront":205,"route53":206,"s3":207,"ec2":208,"ecs":209,"eks":210,"fargate":211,"vpc":212,"iam":213,"cloudwatch":214,"cloudformation":215,"elastic":216,"beanstalk":217,"devops":218,"functions":219,"acr":220,"aks":221,"service":222,"cosmos":223,"db":224,"run":225,"engine":226,"gke":227,"pub":228,"sub":229,"storage":230,"machine":231,"deep":232,"nlp":233,"computer":234,"vision":235,"analysis":236,"pandas":237,"numpy":238,"scikit":239,"learn":240,"tensorflow":241,"pytorch":242,"keras":243,"matplotlib":244,"seaborn":245,"opencv":246,"scipy":247,"statsmodels":248,"huggingface":249,"transformers":250,"spacy":251,"nltk":252,"gensim":253,"xgboost":254,"lightgbm":255,"catboost":256,"prophet":257,"arima":258,"mlflow":259,"kubeflow":260,"jupyter":261,"colab":262,"databricks":263,"sagemaker":264,"vertex":265,"ml":266,"generative":267,"llm":268,"langchain":269,"llama":270,"chatgpt":271,"openai":272,"stable":273,"diffusion":274,"midjourney":275,"prompt":276,"warehouse":277,"lake":278,"etl":279,"elt":280,"airflow":281,"luigi":282,"dbt":283,"streams":284,"flink":285,"storm":286,"tableau":287,"power":288,"bi":289,"looker":290,"ios":291,"native":292,"flutter":293,"xamarin":294,"ionic":295,"cordova":296,"capacitor":297,"objective":298,"jetpack":299,"compose":300,"expo":301,"unit":302,"integration":303,"selenium":304,"jest":305,"mocha":306,"pytest":307,"cypress":308,"puppeteer":309,"playwright":310,"jasmine":311,"karma":312,"chai":313,"enzyme":314,"library":315,"rspec":316,"cucumber":317,"appium":318,"katalon":319,"postman":320,"soapui":321,"jmeter":322,"loadrunner":323,"gatling":324,"locust":325,"git":326,"bitbucket":327,"jira":328,"trello":329,"slack":330,"notion":331,"agile":332,"scrum":333,"kanban":334,"confluence":335,"asana":336,"mondaycom":337,"microsoft":338,"teams":339,"zoom":340,"google":341,"workspace":342,"office":343,"vscode":344,"intellij":345,"pycharm":346,"eclipse":347,"webstorm":348,"visual":349,"xcode":350,"vim":351,"emacs":352,"nano":353,"tmux":354}