{
  "modelTopology": {
    "class_name": "Sequential",
    "config": {
      "name": "sequential_1",
      "layers": [
        {
          "class_name": "Embedding",
          "config": {
            "input_dim": 1000,
            "output_dim": 16,
            "embeddings_initializer": {
              "class_name": "RandomUniform",
              "config": {
                "minval": -0.05,
                "maxval": 0.05,
                "seed": null
              }
            },
            "embeddings_regularizer": null,
            "activity_regularizer": null,
            "embeddings_constraint": null,
            "mask_zero": null,
            "input_length": 50,
            "name": "embedding_Embedding1",
            "trainable": true,
            "batch_input_shape": [
              null,
              50
            ]
          }
        },
        {
          "class_name": "Conv1D",
          "config": {
            "filters": 4,
            "kernel_initializer": {
              "class_name": "VarianceScaling",
              "config": {
                "scale": 1,
                "mode": "fan_avg",
                "distribution": "normal",
                "seed": null
              }
            },
            "kernel_regularizer": null,
            "kernel_constraint": null,
            "kernel_size": [
              3
            ],
            "strides": [
              1
            ],
            "padding": "valid",
            "dilation_rate": [
              1
            ],
            "activation": "relu",
            "use_bias": true,
            "bias_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "bias_regularizer": null,
            "activity_regularizer": null,
            "bias_constraint": null,
            "name": "conv1d_Conv1D1",
            "trainable": true
          }
        },
        {
          "class_name": "GlobalMaxPooling1D",
          "config": {
            "name": "global_max_pooling1d_GlobalMaxPooling1D1",
            "trainable": true
          }
        },
        {
          "class_name": "Dense",
          "config": {
            "units": 110,
            "activation": "sigmoid",
            "use_bias": true,
            "kernel_initializer": {
              "class_name": "VarianceScaling",
              "config": {
                "scale": 1,
                "mode": "fan_avg",
                "distribution": "normal",
                "seed": null
              }
            },
            "bias_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "kernel_regularizer": null,
            "bias_regularizer": null,
            "activity_regularizer": null,
            "kernel_constraint": null,
            "bias_constraint": null,
            "name": "dense_Dense1",
            "trainable": true
          }
        }
      ]
    },
    "keras_version": "tfjs-layers 4.22.0",
    "backend": "tensor_flow.js"
  },
  "format": "layers-model",
  "generatedBy": "TensorFlow.js v4.22.0",
  "convertedBy": null,
  "weightsManifest": [
    {
      "paths": [
        "./weights.bin"
      ],
      "weights": [
        {
          "name": "embedding_Embedding1/embeddings",
          "shape": [
            1000,
            16
          ],
          "dtype": "float32"
        },
        {
          "name": "conv1d_Conv1D1/kernel",
          "shape": [
            3,
            16,
            4
          ],
          "dtype": "float32"
        },
        {
          "name": "conv1d_Conv1D1/bias",
          "shape": [
            4
          ],
          "dtype": "float32"
        },
        {
          "name": "dense_Dense1/kernel",
          "shape": [
            4,
            110
          ],
          "dtype": "float32"
        },
        {
          "name": "dense_Dense1/bias",
          "shape": [
            110
          ],
          "dtype": "float32"
        }
      ]
    }
  ]
}